app/controllers/airports_controller.rb

SELECT "airports".* FROM "airports"
---
  def index
    @airports = Airport.all