app/controllers/carrentals_controller.rb

SELECT "carrentals".* FROM "carrentals"
---
  def index
    @carrentals = Carrental.all

SELECT  "carrentals".* FROM "carrentals" WHERE "carrentals"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @carrental = Carrental.find(params[:id])

SELECT  "carrentals".* FROM "carrentals" WHERE "carrentals"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @carrental = Carrental.find(params[:id])