app/controllers/groceries_controller.rb

SELECT "groceries".* FROM "groceries"
---
  def index
    @groceries = Grocery.all