app/controllers/households_controller.rb

  def index
    @households = Household.all
---
SELECT "households".* FROM "households"

  def show
    @household = Household.find(params[:id])
---
SELECT  "households".* FROM "households" WHERE "households"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @household = Household.find(params[:id])
---
SELECT  "households".* FROM "households" WHERE "households"."id" = ? LIMIT 1  [["id", 1]]