app/controllers/locals_controller.rb

SELECT "locals".* FROM "locals"
---
  def index
    @locals = Local.all