app/controllers/medicals_controller.rb

SELECT "medicals".* FROM "medicals"
---
  def index
    @medicals = Medical.all