app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "My Tester"], ["email", "mytester@gmail.com"], ["created_at", "2019-05-16 22:05:08.903309"], ["updated_at", "2019-05-16 22:05:08.903309"]]
INSERT INTO "authorizations" ("user_id", "uid", "provider", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["uid", "49619285"], ["provider", "github"], ["created_at", "2019-05-16 22:05:08.956306"], ["updated_at", "2019-05-16 22:05:08.956306"]]
---
  def create
    begin
      # User is already signed in
      if session?
        if same_as_logged_in_user? auth_hash['info']
          raise DoubleLoginError,
            "You may not login if your are already logged in"
        else
          raise NotCurrentUserError,
            "Identity Violation - Access Denied!"
        end
      else # Log in or sign up
        # User has already registered and is logging in with same provider
        if Authorization.exists?(auth_hash) # User already registered w/pro
          auth = Authorization.find_with_omniauth(auth_hash)
          message = "Welcome back #{auth.user.name}! " +
                    "You have logged in via #{auth.provider}."
        else
          # User has already registerd and is logging in with new provider
          if User.exists?(auth_hash['info'])
            user = User.find_with_omniauth(auth_hash['info'])
            auth = user.add_provider(auth_hash)
            message =
              "You can now login using #{auth_hash["provider"].capitalize}"
          else # User is registering with a given provider
            user = User.create_with_omniauth(auth_hash['info'])
            auth = user.authorizations.create_with_omniauth(auth_hash)